## Creating a Relational Database From Spreadsheets

Moving from three CSVs to a small relational database.

Download the data here: https://figshare.com/articles/Portal_Project_Teaching_Database/1314459

DB Browser for SQLite here: https://sqlitebrowser.org/

Lesson Adapted from:
http://benbestphd.com/R-ecology-lesson/r-and-sql.html#introduction

#### Instructions for libraries

In [1]:
install.packages('RSQLite')

package 'RSQLite' successfully unpacked and MD5 sums checked

The downloaded binary packages are in
	C:\Users\jkenyon\AppData\Local\Temp\RtmpEnklld\downloaded_packages

In [2]:
library(RSQLite)

#### Set your working directory where the data is located, and where we will create the database

In [3]:
setwd("wlf550_data/March_03/")

#### Reading in data

In this case, we have three CSVs: species - with species information; surveys - with observations of species; and plots - information about specific study plots.

We will read each CSV/spreadsheet in as its own dataframe.

In [6]:
species <- read.csv("species.csv", stringsAsFactors=FALSE)
surveys <- read.csv("surveys.csv", stringsAsFactors=FALSE)
plots <- read.csv("plots.csv", stringsAsFactors=FALSE)

In [8]:
nrow(species)
head(species)
nrow(surveys)
head(surveys)
nrow(plots)
head(plots)

[1] 54

  species_id genus            species         taxa
1 AB         Amphispiza       bilineata       Bird
2 AH         Ammospermophilus harrisi         Rodent
3 AS         Ammodramus       savannarum      Bird
4 BA         Baiomys          taylori         Rodent
5 CB         Campylorhynchus  brunneicapillus Bird
6 CM         Calamospiza      melanocorys     Bird

[1] 35549

  record_id month day year plot_id species_id sex hindfoot_length weight
1 1         7     16  1977 2       NL         M   32              NA
2 2         7     16  1977 3       NL         M   33              NA
3 3         7     16  1977 2       DM         F   37              NA
4 4         7     16  1977 7       DM         M   36              NA
5 5         7     16  1977 3       DM         M   35              NA
6 6         7     16  1977 1       PF         M   14              NA

[1] 24

  plot_id plot_type
1 1       Spectab exclosure
2 2       Control
3 3       Long-term Krat Exclosure
4 4       Control
5 5       Rodent Exclosure
6 6       Short-term Krat Exclosure

## Creating a relational database

* We start by creating the file/filename.
* Then, we create a database connection, which accesses the file.
* The db connection is the primary object we call throughout our code.

In [9]:
myDB <- "wlf550.db"

In [38]:
myConn <- dbConnect(drv = SQLite(), dbname= myDB)

#### Writing a CSV to create a table

In [10]:
dbWriteTable(myConn,"species",species)

In [11]:
dbListTables(myConn)

[1] "species"

In [12]:
dbWriteTable(myConn,"surveys",surveys)

In [13]:
dbWriteTable(myConn,"plots",plots)

In [39]:
dbListTables(myConn)

[1] "plots"   "species" "surveys"

#### Querying the Database using SQL


SQL = Structured Query Language<br>
(Adapted from: https://www.dofactory.com/sql/)

* SELECT: The SELECT statement retrieves data from a database. The asterisk \* means return everything from the matching row.<br>
* FROM: The FROM term needs to be followed by the table-name.<br>
* LIMIT: The LIMIT term places a restriction on how many results are to be returned, specified by an integer.

In [15]:
# Query: retrieve all information from the first 10 rows of the species table

dbGetQuery(myConn, "SELECT * FROM species LIMIT 10")

   species_id genus            species         taxa
1  AB         Amphispiza       bilineata       Bird
2  AH         Ammospermophilus harrisi         Rodent
3  AS         Ammodramus       savannarum      Bird
4  BA         Baiomys          taylori         Rodent
5  CB         Campylorhynchus  brunneicapillus Bird
6  CM         Calamospiza      melanocorys     Bird
7  CQ         Callipepla       squamata        Bird
8  CS         Crotalus         scutalatus      Reptile
9  CT         Cnemidophorus    tigris          Reptile
10 CU         Cnemidophorus    uniparens       Reptile

In [16]:
tenSpeciesRows <- dbGetQuery(myConn, "SELECT * FROM species LIMIT 10")

In [17]:
typeof(tenSpeciesRows)
dim(tenSpeciesRows)

[1] "list"

[1] 10  4

In [18]:
dbListFields(myConn, "species")

[1] "species_id" "genus"      "species"    "taxa"

In [19]:
# Query: retrieve the record id number and the associated hindfoot length for the first 10 observations in the survey table.

dbGetQuery(myConn, "SELECT * FROM surveys LIMIT 10")

   record_id month day year plot_id species_id sex hindfoot_length weight
1   1        7     16  1977 2       NL         M   32              NA
2   2        7     16  1977 3       NL         M   33              NA
3   3        7     16  1977 2       DM         F   37              NA
4   4        7     16  1977 7       DM         M   36              NA
5   5        7     16  1977 3       DM         M   35              NA
6   6        7     16  1977 1       PF         M   14              NA
7   7        7     16  1977 2       PE         F   NA              NA
8   8        7     16  1977 1       DM         M   37              NA
9   9        7     16  1977 1       DM         F   34              NA
10 10        7     16  1977 6       PF         F   20              NA

### Conditional Queries

Select queries can operate against specific parameters.
* WHERE: The WHERE term must be followed by a column-name, as in retrieve data where a field  matches a particular pattern.
* CONDITIONS: Standard operators of =, >, <, etc. apply. Boolean operators of AND, OR, NOT also apply.

In [21]:
# Query: retrieve all records from the surveys table where hindfoot length is greater than 20.
# Query: retrieve all records from the species table where the genus starts with Crot.

#dbGetQuery(myConn, "SELECT * FROM surveys WHERE hindfoot_length > 20")
dbGetQuery(myConn, "SELECT * FROM species WHERE genus LIKE '%Crot%'")

  species_id genus    species    taxa
1 CS         Crotalus scutalatus Reptile
2 CV         Crotalus viridis    Reptile

In [22]:
dbGetQuery(myConn,"SELECT count(*) FROM surveys")

  count(*)
1 35549

In [23]:
dbGetQuery(myConn, "SELECT * FROM surveys WHERE species_id = 'PP' LIMIT 40")
#dbGetQuery(myConn, "SELECT * FROM species LIMIT 40")

   record_id month day year plot_id species_id sex hindfoot_length weight
1    18       7    16  1977  2      PP         M   22              NA
2    29       7    17  1977 11      PP         M   NA              NA
3    49       7    18  1977 12      PP         F   17              NA
4    89       8    20  1977 12      PP         F   20              15
5   108       8    20  1977 11      PP         M   21              NA
6   163       9    11  1977 12      PP         F   21              16
7   217       9    13  1977  3      PP         F   19              15
8   897       5    18  1978 11      PP         M   21              15
9   933       5    19  1978  2      PP         F   20              13
10  981       6     8  1978 11      PP         M   21              15
11  991       6     9  1978 13      PP         M   23              17
12 1032       7     7  1978 11      PP         M   22              16
13 1076       7     8  1978 15      PP         F   21              12
14 1078       7     8  1978 15      PP         F   23              10
15 1088       7     8  1978 14      PP         M   23              10
16 1116       8     4  1978 12      PP         M   22              18
17 1126       8     4  1978 20      PP         F   22              13
18 1135       8     4  1978 21      PP         M   19              14
19 1181       8     5  1978 15      PP         F   21              14
20 1201       9     3  1978 12      PP         M   23              19
21 1221       9     3  1978 11      PP         F   22              14
22 1227       9     3  1978 11      PP         M   22              13
23 1236       9     3  1978 21      PP         M   22              15
24 1257       9     4  1978  3      PP         F   21              13
25 1264       9     4  1978 15      PP         F   20              15
26 1294       9     4  1978  2      PP         M   21              19
27 1318      10     7  1978 11      PP         F   21              15
28 1352      10     8  1978  3      PP         F   22              NA
29 1368      10     8  1978 15      PP         F   21              16
30 1375      10     8  1978 13      PP         M   23              20
31 1378      10     8  1978 18      PP         M   21              16
32 1757       4    29  1979 15      PP         F   21              15
33 1789       5    29  1979 20      PP         M   21              20
34 1823       5    30  1979 15      PP         F   22              NA
35 1842       5    30  1979 15      PP         M   22              20
36 1884       7     4  1979 15      PP         F   22              14
37 1895       7     4  1979 15      PP         F   20              16
38 1898       7     4  1979  2      PP         M   20              10
39 1940       7    25  1979 11      PP         M   22              16
40 1946       7    26  1979 15      PP         F   22              16

### SQL Joins
More Resources: https://www.dofactory.com/sql/join

JOINs combine records from two tables. For example,  you might want to subset some data from table A and append to it associated data from table B.

Below are ways to think about the different types of JOINs. The most common is the INNER JOIN.

<img src="https://www.dofactory.com/Images/sql-joins.png" style="background-color:white">

#### Query:  Retrieve the genera where observed hindfoot length is less than 20.

In [26]:
query_species <- "SELECT genus FROM surveys WHERE hindfoot_length < 20"

In [27]:
dbGetQuery(myConn, query_species)

ERROR: Error in rsqlite_send_query(conn@ptr, statement): no such column: genus

In [30]:
query_species <- "
SELECT species.genus, count(*)
FROM species 
JOIN surveys
ON species.species_id = surveys.species_id
WHERE surveys.hindfoot_length < 20
GROUP BY species.genus"

In [31]:
dbGetQuery(myConn, query_species)

  genus           count(*)
1 Baiomys           45
2 Chaetodipus       88
3 Dipodomys          1
4 Onychomys        509
5 Perognathus     1475
6 Peromyscus       399
7 Reithrodontomys 2515
8 Sigmodon           2

#### Query:  Retrieve the count of each genus for each plot type

In [32]:
plotType_query <- "SELECT d.plot_type, c.genus, count(*) AS count
FROM
(SELECT a.genus, b.plot_id
FROM species a
JOIN surveys b
ON a.species_id = b.species_id) c
JOIN plots d
ON c.plot_id = d.plot_id
GROUP BY d.plot_type, c.genus
ORDER BY d.plot_type, count DESC"

In [33]:
plotType_query <- "SELECT d.plot_type, c.genus, count(*) AS count
FROM
(SELECT a.genus, b.plot_id
FROM species a
JOIN surveys b
ON a.species_id = b.species_id) c
JOIN plots d
ON c.plot_id = d.plot_id
GROUP BY d.plot_type, c.genus
ORDER BY d.plot_type, count DESC"

In [ ]:
result <- dbGetQuery(myConn, plotType_query)
result

#### Query: For every other year in the dataset, return the number of observations of rodents

In [35]:
yearRange <- dbGetQuery(myConn, "SELECT min(year),max(year) FROM surveys")
years <- seq(yearRange[,1],yearRange[,2],by=2)

In [36]:
year_query <- paste("
SELECT a.year, b.taxa, count(*) as count
FROM surveys AS a
JOIN species AS b
ON a.species_id = b.species_id
AND b.taxa = 'Rodent'
AND a.year in (",
paste(years,collapse=",")
,")
GROUP BY a.year, b.taxa",
sep = "")

rCount <- dbGetQuery(myConn, year_query)
rCount

   year taxa   count
1  1977 Rodent  487
2  1979 Rodent  658
3  1981 Rodent 1394
4  1983 Rodent 1594
5  1985 Rodent 1398
6  1987 Rodent 1618
7  1989 Rodent 1522
8  1991 Rodent 1306
9  1993 Rodent  697
10 1995 Rodent 1168
11 1997 Rodent 2488
12 1999 Rodent 1108
13 2001 Rodent 1536

In [145]:
write.csv(rCount,"2020-03-03_WLF550_programmaticQueryResult.csv", row.names = FALSE)

In [37]:
dbDisconnect(myConn)